//===========================================================================
//文件名称：systick.h
//功能概要：systick定时器模块构件头文件
//版权所有：苏州大学嵌入式系统与物联网研究所(sumcu.suda.edu.cn)
//更新记录：2016-3-20   V4.0
//===========================================================================

#ifndef _SYSTICK_H
#define _SYSTICK_H

#include "common.h"
 
//时钟源宏定义
#define CORE_CLOCK         1
#define CORE_CLOCK_DIV_16  0
//===========================================================================
//函数名称：systick_init
//函数返回：无
//参数说明：clk_src_sel：时钟源选择：1：内核时钟（core_clk_khz）;
//                             0：内核时钟/16。
//         int_ms:中断的时间间隔。单位ms 推荐选用5,10,......,最大为50
//功能概要：初始化SysTick模块，设置中断的时间间隔
//说明：内核时钟频率core_clk_khz宏定义在sysinit.h中
//===========================================================================
void systick_init(uint_8 clk_src_sel, uint_8 int_ms);

#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学嵌入式系统与物联网研究所
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
